app/Http/Livewire/Recipes/Rate.php

    public function render()
    {
        $rating = Rating::where('user_id', Auth::id())->where('recipe_id', $this->recipeId);

        if ($rating->count()) {
---
select count(*) as aggregate from `ratings` where `user_id` = 1 and `recipe_id` = 1