app/Http/Livewire/Comments.php

select * from `comments` where `comments`.`recipe_id` in (1) order by `created_at` desc
---
    public function render()
    {
        $this->recipe->load('comments.user');