app/Http/Controllers/MenuController.php

            $query->whereIn('date', $weekDays);
        })->where('user_id', Auth::id())->first();

        $recipeCount = Recipe::count();
---
select count(*) as aggregate from `recipes` where `recipes`.`deleted_at` is null