app/Http/Controllers/PagesController.php

select `recipes`.*, (select coalesce(avg(score),0) from `ratings` where `recipes`.`id` = `ratings`.`recipe_id`) as `average_rating` from `recipes` where `recipes`.`deleted_at` is null order by `average_rating` desc limit 6
---
    public function homepage(): View
    {
        $topRecipes = Recipe::with('ratings', 'media')->withCount(['ratings as average_rating' => function($query) {
            $query->select(DB::raw('coalesce(avg(score),0)'));
        }])->orderByDesc('average_rating')->take(6)->get();