app/Http/Controllers/RecipeController.php

select * from `allergens`
select * from `categories`
---
    public function create(): View
    {
        abort_if(Gate::denies('meal_create'), 403);

        $allergens = Allergen::all();
        $categories = Category::all();

select `level`, `allergen_id` from `allergens` inner join `allergen_recipe` on `allergens`.`id` = `allergen_recipe`.`allergen_id` where `allergen_recipe`.`recipe_id` = 1
select * from `allergens`
---
    public function show(Recipe $recipe): View
    {
        abort_if(Gate::denies('meal_show'), 403);

        $allergens = $recipe->allergens()->pluck('level', 'allergen_id')->toArray();
        $allAllergens = Allergen::all();